adpyke.codesnap
anan.jetbrains-darcula-theme
anysphere.pyright
artlaman.chalice-color-theme
avetis.tokyo-night
beardedbear.beardedicons
bigonesystems.django
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
catppuccin.catppuccin-vsc-pack
charliermarsh.ruff
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
drcika.apc-extension
drewxs.tokyo-night-dark
ecmel.vscode-html-css
editorconfig.editorconfig
emeraldwalk.runonsave
enkia.tokyo-night
esbenp.prettier-vscode
firsttris.vscode-jest-runner
formulahendry.auto-close-tag
golang.go
jdinhlife.gruvbox
jebbs.plantuml
jkjustjoshing.vscode-text-pastry
miguelsolorio.fluent-icons
mikestead.dotenv
mrmlnc.vscode-duplicate
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
mullakhmetov.shale
oderwat.indent-rainbow
pmndrs.pmndrs
rangav.vscode-thunder-client
redhat.vscode-yaml
sainnhe.everforest
samuelcolvin.jinjahtml
tamasfe.even-better-toml
vue.volar
wayou.vscode-todo-highlight
