anysphere.pyright
artlaman.chalice-color-theme
beardedbear.beardedicons
bigonesystems.django
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
drcika.apc-extension
ecmel.vscode-html-css
editorconfig.editorconfig
emeraldwalk.runonsave
esbenp.prettier-vscode
firsttris.vscode-jest-runner
formulahendry.auto-close-tag
golang.go
gxl.git-graph-3
jdinhlife.gruvbox
jkjustjoshing.vscode-text-pastry
miguelsolorio.fluent-icons
mikestead.dotenv
mrmlnc.vscode-duplicate
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
oderwat.indent-rainbow
rangav.vscode-thunder-client
redhat.vscode-yaml
samuelcolvin.jinjahtml
tamasfe.even-better-toml
vue.volar
wayou.vscode-todo-highlight
