adpyke.codesnap
beardedbear.beardedicons
beardedbear.beardedtheme
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
christian-kohler.path-intellisense
dawranliou.minimal-theme-vscode
dbaeumer.vscode-eslint
ecmel.vscode-html-css
editorconfig.editorconfig
emeraldwalk.runonsave
equinusocio.vsc-material-theme
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
formulahendry.auto-close-tag
github.copilot
github.copilot-chat
golang.go
jakebecker.elixir-ls
jdinhlife.gruvbox
jebbs.plantuml
jgrundback.vscode-mc-theme
jkjustjoshing.vscode-text-pastry
mhutchie.git-graph
miguelsolorio.fluent-icons
mikestead.dotenv
mrmlnc.vscode-duplicate
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
oderwat.indent-rainbow
peymanslh.blueberry-dark-theme
phoenixframework.phoenix
pmndrs.pmndrs
rangav.vscode-thunder-client
redhat.vscode-yaml
robertrossmann.remedy
samuelcolvin.jinjahtml
tamasfe.even-better-toml
vscodevim.vim
vue.volar
wayou.vscode-todo-highlight
