adpyke.codesnap
alefragnani.bookmarks
antfu.icons-carbon
batisteo.vscode-django
beardedbear.beardedtheme
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
cdonohue.quill-icons
charliermarsh.ruff
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
emeraldwalk.runonsave
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
formulahendry.auto-close-tag
github.copilot
github.copilot-chat
golang.go
jdinhlife.gruvbox
jebbs.plantuml
jkjustjoshing.vscode-text-pastry
miguelsolorio.fluent-icons
mikestead.dotenv
monosans.djlint
mrmlnc.vscode-duplicate
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
pmndrs.pmndrs
redhat.vscode-yaml
ritwickdey.liveserver
samuelcolvin.jinjahtml
vscodevim.vim
vue.volar
wayou.vscode-todo-highlight
wholroyd.jinja
wicked-labs.wvsc-serendipity
