akamud.vscode-theme-onedark
batisteo.vscode-django
christian-kohler.path-intellisense
EditorConfig.EditorConfig
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
formulahendry.auto-close-tag
golang.go
HookyQR.beautify
mikestead.dotenv
ms-azuretools.vscode-docker
ms-python.python
ms-vscode.sublime-keybindings
PKief.material-icon-theme
tonsky.theme-alabaster
vscoss.vscode-ansible
wayou.vscode-todo-highlight
wholroyd.jinja
