adpyke.codesnap
alefragnani.Bookmarks
antfu.icons-carbon
batisteo.vscode-django
bradlc.vscode-tailwindcss
Catppuccin.catppuccin-vsc
cdonohue.quill-icons
charliermarsh.ruff
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
EditorConfig.EditorConfig
emeraldwalk.RunOnSave
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
golang.go
JakeBecker.elixir-ls
jdinhlife.gruvbox
jebbs.plantuml
mikestead.dotenv
monosans.djlint
mrmlnc.vscode-duplicate
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
phoenixframework.phoenix
pmndrs.pmndrs
redhat.vscode-yaml
ritwickdey.LiveServer
samuel-pordeus.elixir-test
samuelcolvin.jinjahtml
vscodevim.vim
Vue.volar
Vue.vscode-typescript-vue-plugin
wayou.vscode-todo-highlight
wholroyd.jinja
ziglang.vscode-zig
